{
  "phrasalVerbs": [
    {
      "phrasalVerb": "Get up to",
      "baseVerb": "Get",
      "category": "phrasal_verbs",
      "pronunciation": "/ɡet ʌp tuː/",
      "meanings": [
        {
          "id": "m_pv_001_1",
          "text": "Làm (điều gì đó, thường là nghịch ngợm, không mong muốn hoặc bí mật)",
          "notes": "Thường dùng với ý tò mò hoặc nghi ngờ về hành động của ai đó, đặc biệt là trẻ con hoặc khi ai đó có vẻ đang làm điều gì đó lén lút.",
          "examples": [
            {
              "id": "ex_pv_001_1_1",
              "eng": "What have the children been getting up to while we were out?",
              "vie": "Bọn trẻ đã làm những trò gì trong khi chúng ta đi vắng vậy?"
            },
            {
              "id": "ex_pv_001_1_2",
              "eng": "I wonder what he's getting up to in the garage.",
              "vie": "Tôi tự hỏi anh ấy đang làm gì trong gara."
            },
            {
              "id": "ex_pv_001_1_3",
              "eng": "She's been very quiet. I'm sure she's getting up to something.",
              "vie": "Con bé im lặng lắm. Tôi chắc là nó đang bày trò gì đó."
            }
          ]
        },
        {
          "id": "m_pv_001_2",
          "text": "Đạt đến một điểm hoặc một mức độ nào đó (thường là về số lượng, tiến độ)",
          "notes": "Dùng để chỉ việc hoàn thành hoặc tiến triển đến một giai đoạn cụ thể trong một công việc hoặc quá trình.",
          "examples": [
            {
              "id": "ex_pv_001_2_1",
              "eng": "What page did you get up to in the book?",
              "vie": "Bạn đã đọc đến trang nào của cuốn sách rồi?"
            },
            {
              "id": "ex_pv_001_2_2",
              "eng": "We got up to chapter 5 in our studies last week.",
              "vie": "Chúng tôi đã học đến chương 5 vào tuần trước."
            },
            {
              "id": "ex_pv_001_2_3",
              "eng": "The builders have only got up to the first floor.",
              "vie": "Đội thợ xây mới chỉ xây xong tầng một thôi."
            }
          ]
        }
      ],
      "tags": ["activity", "behavior", "progress"],
      "generalNotes": "Một cụm động từ phổ biến, có thể mang nghĩa tiêu cực (nghịch ngợm) hoặc trung tính (tiến độ)."
    },
    {
      "phrasalVerb": "Get at (someone)",
      "baseVerb": "Get",
      "category": "phrasal_verbs",
      "pronunciation": "/ɡɛt æt/",
      "meanings": [
        {
          "id": "m_pv_002_1",
          "text": "Chỉ trích, công kích ai đó",
          "notes": "Thường mang ý nghĩa tiêu cực, diễn tả sự công kích hoặc phàn nàn lặp đi lặp lại một cách khó chịu.",
          "examples": [
            {
              "id": "ex_pv_002_1_1",
              "eng": "He's always getting at his younger brother.",
              "vie": "Anh ta luôn chỉ trích em trai mình."
            },
            {
              "id": "ex_pv_002_1_2",
              "eng": "Why are you always getting at me? I haven't done anything wrong.",
              "vie": "Tại sao bạn cứ chỉ trích tôi hoài vậy? Tôi đâu có làm gì sai."
            }
          ]
        },
        {
          "id": "m_pv_002_2",
          "text": "Cố gắng diễn đạt, ám chỉ điều gì",
          "notes": "Dùng khi muốn diễn đạt một ý một cách không trực tiếp, hoặc dò hỏi, tìm hiểu xem người khác đang muốn nói gì.",
          "examples": [
            {
              "id": "ex_pv_002_2_1",
              "eng": "What are you getting at? Just say it clearly.",
              "vie": "Bạn đang cố ám chỉ điều gì vậy? Cứ nói rõ ràng đi."
            },
            {
              "id": "ex_pv_002_2_2",
              "eng": "I think I see what you're getting at, but could you explain further?",
              "vie": "Tôi nghĩ tôi hiểu bạn đang ám chỉ điều gì, nhưng bạn có thể giải thích thêm được không?"
            }
          ]
        }
      ],
      "tags": ["communication", "criticism"],
      "generalNotes": "Có thể có hai nghĩa chính: một là chỉ trích, công kích ai đó; hai là cố gắng diễn đạt hoặc ám chỉ điều gì đó một cách không trực tiếp."
    },
    {
      "phrasalVerb": "Get rid of (something)",
      "baseVerb": "Get",
      "category": "phrasal_verbs",
      "pronunciation": "/ɡɛt rɪd əv/",
      "meanings": [
        {
          "id": "m_pv_003_1",
          "text": "Loại bỏ, vứt bỏ, tống khứ",
          "notes": "Hành động chủ động loại bỏ một vật, một người hoặc một tình huống không mong muốn, làm cho nó không còn tồn tại hoặc ảnh hưởng đến mình nữa.",
          "examples": [
            {
              "id": "ex_pv_003_1_1",
              "eng": "We need to get rid of all this old furniture.",
              "vie": "Chúng ta cần loại bỏ hết đống đồ đạc cũ này."
            },
            {
              "id": "ex_pv_003_1_2",
              "eng": "She finally got rid of her old car and bought a new one.",
              "vie": "Cuối cùng cô ấy cũng đã tống khứ được chiếc xe cũ và mua một chiếc mới."
            }
          ]
        }
      ],
      "tags": ["actions_tasks", "objects_things"],
      "generalNotes": ""
    },
    {
      "phrasalVerb": "Get on with (someone)",
      "baseVerb": "Get",
      "category": "phrasal_verbs",
      "pronunciation": "/ɡɛt ɒn wɪð/",
      "meanings": [
        {
          "id": "m_pv_004_1",
          "text": "Có mối quan hệ tốt, hòa hợp với ai đó",
          "notes": "Diễn tả mối quan hệ thân thiện, không xung đột giữa hai hay nhiều người.",
          "examples": [
            {
              "id": "ex_pv_004_1_1",
              "eng": "I get on well with most of my colleagues.",
              "vie": "Tôi hòa hợp tốt với hầu hết các đồng nghiệp của mình."
            },
            {
              "id": "ex_pv_004_1_2",
              "eng": "They seem to get on well with each other.",
              "vie": "Họ có vẻ rất hòa hợp với nhau."
            }
          ]
        }
      ],
      "tags": ["relationships_social"],
      "generalNotes": "Cũng có thể dùng 'get along with'."
    },
    {
      "phrasalVerb": "Get over (something/someone)",
      "baseVerb": "Get",
      "category": "phrasal_verbs",
      "pronunciation": "/ɡɛt ˈoʊvər/",
      "meanings": [
        {
          "id": "m_pv_005_1",
          "text": "Vượt qua, bình phục (sau cú sốc, bệnh tật, thất tình)",
          "notes": "Chỉ sự phục hồi về thể chất hoặc tinh thần sau một trải nghiệm khó khăn hoặc một mất mát.",
          "examples": [
            {
              "id": "ex_pv_005_1_1",
              "eng": "It can take a long time to get over a serious illness.",
              "vie": "Có thể mất một thời gian dài để bình phục sau một căn bệnh nghiêm trọng."
            },
            {
              "id": "ex_pv_005_1_2",
              "eng": "It took her months to get over the shock of her father's death.",
              "vie": "Cô ấy phải mất nhiều tháng để vượt qua cú sốc sau cái chết của cha mình."
            }
          ]
        }
      ],
      "tags": ["health_wellbeing", "emotions_feelings"],
      "generalNotes": ""
    },
    {
      "phrasalVerb": "Get away with (something)",
      "baseVerb": "Get",
      "category": "phrasal_verbs",
      "pronunciation": "/ɡɛt əˈweɪ wɪð/",
      "meanings": [
        {
          "id": "m_pv_006_1",
          "text": "Thoát tội, không bị trừng phạt cho việc làm sai trái",
          "notes": "Hành động làm điều gì đó sai trái nhưng không bị phát hiện hoặc không phải chịu hậu quả.",
          "examples": [
            {
              "id": "ex_pv_006_1_1",
              "eng": "He thought he could get away with cheating on the test, but he got caught.",
              "vie": "Cậu ta nghĩ mình có thể thoát tội gian lận trong bài kiểm tra, nhưng đã bị bắt."
            },
            {
              "id": "ex_pv_006_1_2",
              "eng": "No one should get away with breaking the law.",
              "vie": "Không ai được phép thoát tội khi vi phạm pháp luật."
            }
          ]
        }
      ],
      "tags": ["problems_solutions", "behavior"],
      "generalNotes": "Nghĩa chính là thoát khỏi sự trừng phạt."
    },
    {
      "phrasalVerb": "Get out of (doing something)",
      "baseVerb": "Get",
      "category": "phrasal_verbs",
      "pronunciation": "/ɡɛt aʊt əv/",
      "meanings": [
        {
          "id": "m_pv_007_1",
          "text": "Tránh né làm việc gì (thường là việc không muốn làm)",
          "notes": "Nghĩa là tìm cách không phải thực hiện một nhiệm vụ hoặc trách nhiệm nào đó mà bản thân không thích.",
          "examples": [
            {
              "id": "ex_pv_007_1_1",
              "eng": "She tried to get out of attending the boring meeting.",
              "vie": "Cô ấy đã cố gắng tránh tham dự cuộc họp nhàm chán đó."
            },
            {
              "id": "ex_pv_007_1_2",
              "eng": "He's always trying to get out of washing the dishes.",
              "vie": "Anh ấy luôn cố gắng trốn việc rửa bát."
            }
          ]
        }
      ],
      "tags": ["actions_tasks", "avoidance"],
      "generalNotes": ""
    },
    {
      "phrasalVerb": "Get through to (someone)",
      "baseVerb": "Get",
      "category": "phrasal_verbs",
      "pronunciation": "/ɡɛt θruː tuː/",
      "meanings": [
        {
          "id": "m_pv_008_1",
          "text": "Làm cho ai đó hiểu điều mình nói",
          "notes": "Nỗ lực làm cho người khác tiếp nhận và hiểu được thông điệp hoặc quan điểm của mình.",
          "examples": [
            {
              "id": "ex_pv_008_1_1",
              "eng": "It's hard to get through to him when he's in a bad mood.",
              "vie": "Rất khó để làm anh ấy hiểu khi anh ấy đang bực mình."
            },
            {
              "id": "ex_pv_008_1_2",
              "eng": "I've tried explaining it to her, but I just can't get through to her.",
              "vie": "Tôi đã cố giải thích cho cô ấy, nhưng tôi không thể làm cô ấy hiểu được."
            }
          ]
        },
        {
          "id": "m_pv_008_2",
          "text": "Liên lạc được (qua điện thoại)",
          "notes": "Thành công trong việc kết nối liên lạc với ai đó, đặc biệt là qua điện thoại sau nhiều nỗ lực.",
          "examples": [
            {
              "id": "ex_pv_008_2_1",
              "eng": "I finally got through to him on his mobile after several tries.",
              "vie": "Cuối cùng tôi cũng liên lạc được với anh ấy qua điện thoại di động sau nhiều lần thử."
            },
            {
              "id": "ex_pv_008_2_2",
              "eng": "After being on hold for an hour, I finally got through to a customer service representative.",
              "vie": "Sau khi phải chờ máy một tiếng, cuối cùng tôi cũng kết nối được với một nhân viên dịch vụ khách hàng."
            }
          ]
        }
      ],
      "tags": ["communication", "understanding"],
      "generalNotes": ""
    },
    {
      "phrasalVerb": "Get wound up (about something)",
      "baseVerb": "Get",
      "category": "phrasal_verbs",
      "pronunciation": "/ɡɛt waʊnd ʌp/",
      "meanings": [
        {
          "id": "m_pv_009_1",
          "text": "Trở nên tức giận, lo lắng hoặc bực bội",
          "notes": "Diễn tả trạng thái cảm xúc tiêu cực, căng thẳng quá mức về một vấn đề nào đó.",
          "examples": [
            {
              "id": "ex_pv_009_1_1",
              "eng": "Don't get so wound up about it; it's not a big deal.",
              "vie": "Đừng quá bực bội về chuyện đó; không có gì to tát đâu."
            },
            {
              "id": "ex_pv_009_1_2",
              "eng": "She gets wound up very easily when things don't go her way.",
              "vie": "Cô ấy rất dễ bực bội khi mọi việc không theo ý mình."
            }
          ]
        }
      ],
      "tags": ["emotions_feelings"],
      "generalNotes": ""
    },
    {
      "phrasalVerb": "Get along (with someone)",
      "baseVerb": "Get",
      "category": "phrasal_verbs",
      "pronunciation": "/ɡɛt əˈlɔŋ/",
      "meanings": [
        {
          "id": "m_pv_010_1",
          "text": "Hòa thuận, có mối quan hệ tốt với ai đó",
          "notes": "Tương tự như 'get on with someone', chỉ mối quan hệ hòa hợp, thân thiện.",
          "examples": [
            {
              "id": "ex_pv_010_1_1",
              "eng": "My cat and dog get along surprisingly well.",
              "vie": "Con mèo và con chó của tôi hòa thuận với nhau một cách đáng ngạc nhiên."
            },
            {
              "id": "ex_pv_010_1_2",
              "eng": "Despite their differences, the two leaders seem to get along.",
              "vie": "Bất chấp những khác biệt, hai nhà lãnh đạo dường như hòa thuận với nhau."
            }
          ]
        }
      ],
      "tags": ["relationships_social"],
      "generalNotes": "Thường đi kèm 'with someone'."
    },
    {
      "phrasalVerb": "Get around",
      "baseVerb": "Get",
      "category": "phrasal_verbs",
      "pronunciation": "/ɡɛt əˈraʊnd/",
      "meanings": [
        {
          "id": "m_pv_011_1",
          "text": "Đi lại nhiều nơi",
          "notes": "Di chuyển từ nơi này đến nơi khác, thường là trong một khu vực nhất định.",
          "examples": [
            {
              "id": "ex_pv_011_1_1",
              "eng": "It's quite easy to get around this city by bike.",
              "vie": "Khá dễ dàng để đi lại trong thành phố này bằng xe đạp."
            },
            {
              "id": "ex_pv_011_1_2",
              "eng": "She doesn't have a car, so she gets around by bus.",
              "vie": "Cô ấy không có ô tô nên cô ấy đi lại bằng xe buýt."
            }
          ]
        },
        {
          "id": "m_pv_011_2",
          "text": "Lan truyền (tin tức)",
          "notes": "Chỉ thông tin, tin đồn được truyền đi, phổ biến rộng rãi.",
          "examples": [
            {
              "id": "ex_pv_011_2_1",
              "eng": "News of their secret wedding quickly got around.",
              "vie": "Tin tức về đám cưới bí mật của họ nhanh chóng lan truyền."
            },
            {
              "id": "ex_pv_011_2_2",
              "eng": "It didn't take long for word to get around that he had resigned.",
              "vie": "Không mất nhiều thời gian để tin tức anh ấy từ chức lan truyền đi."
            }
          ]
        },
        {
          "id": "m_pv_011_3",
          "text": "Tìm cách giải quyết (vấn đề), lách (luật)",
          "notes": "Tìm ra cách để đối phó hoặc vượt qua một khó khăn, quy định mà không vi phạm trực tiếp hoặc bằng cách khôn khéo.",
          "examples": [
            {
              "id": "ex_pv_011_3_1",
              "eng": "She knows how to get around the rules.",
              "vie": "Cô ấy biết cách lách luật."
            },
            {
              "id": "ex_pv_011_3_2",
              "eng": "We need to find a way to get around these technical difficulties.",
              "vie": "Chúng ta cần tìm cách để giải quyết những khó khăn kỹ thuật này."
            }
          ]
        }
      ],
      "tags": ["travel_movement", "information", "problems_solutions"],
      "generalNotes": "Có nhiều nghĩa khác nhau."
    }
  ]
}
